# Brewfile for Shaunak's Mac Setup
# Install with: brew bundle

# CLI Tools
brew "chezmoi"           # Dotfile manager
brew "git"               # Version control
brew "mas"               # Mac App Store CLI
brew "wget"              # Download tool
brew "curl"              # Transfer data
brew "jq"                # JSON processor
brew "tree"              # Directory visualization
brew "htop"              # Process viewer
brew "eza"               # Modern ls replacement
brew "bat"               # Better cat
brew "ripgrep"           # Fast grep
brew "fd"                # Fast find
brew "fzf"               # Fuzzy finder
# Machine-specific tools (uncomment as needed)
# brew "kanata"          # Keyboard remapping (M1 MacBook Pro only)

# Shell Enhancement Tools
brew "zoxide"            # Smarter cd command
brew "atuin"             # Enhanced shell history
brew "mise"              # Runtime version manager (node, python, go, etc.)

# Note: zsh-autosuggestions and zsh-syntax-highlighting
# are now managed by Zinit plugin manager

# Fonts (for Powerlevel10k)
cask "font-meslo-lg-nerd-font"

# Productivity & Automation
cask "raycast"           # Launcher and productivity
cask "bettertouchtool"   # Gesture and automation tool
cask "elgato-stream-deck" # Stream Deck software
cask "betterdisplay"     # Display management
cask "1password"         # Password manager
cask "1password-cli"     # 1Password CLI

# Utilities
cask "daisydisk"         # Disk space analyzer
cask "jump-desktop"      # Remote desktop
cask "the-unarchiver"    # Archive extraction
cask "appcleaner"        # App uninstaller

# Browsers
cask "google-chrome"
cask "firefox"

# Communication
cask "discord"
cask "slack"

# Development (optional - uncomment if needed)
# brew "python"
# brew "node"
# brew "go"
# cask "visual-studio-code"
# cask "iterm2"

# Media
# cask "vlc"
# cask "spotify"

# Mac App Store Apps (uncomment and add IDs as needed)
# mas "Todoist", id: 585829637
# mas "Things", id: 904280696
